// Напишите программу, которая запрашивает у пользователя ввод чисел до тех пор, пока он не введет число, которое делится на 7 без остатка. После этого программа должна вывести сумму всех введенных чисел и их количество.
// #include<iostream>
// using namespace std;
// int main(){
//     int a;
//     int k=0;
//     int sum=0;
//     do{
//         cout<<"введите число: ";
//         cin>>a;
//         if(a%7!=0){sum+=a;k++;}
//     }while(a%7!=0);
//     cout<<"введенное кол-во символов: "<<k<<endl;
//     cout<<"сумма введеных символов: "<<sum<<endl;
// }


