// // Напишите программу, которая использует if для проверки, является ли число положительным, отрицательным или нулем.
// #include<iostream>
// using namespace std;
// int main(){
//     int a;
//     cout<<"Введите число: "<<endl;
//     cin>>a;
//     if(a>0) {cout<<"Число "<<a<<": положительное";}
//     if(a<0) {cout<<"Число "<<a<<": отрицательное";}
//     if(a==0) {cout<<"Число "<<a<<": равно нулю";}
//     return 0;
// }


// // Создайте функцию, которая принимает два числа и возвращает их сумму.
// #include<iostream>
// using namespace std;
// int f(int a,int b){return a+b;}
// int main(){
//     int a,b;
//     cout<<"Введите два числа: "<<endl;
//     cin>>a>>b;
//     cout<<f(a,b);
// }


// // Используйте цикл for для вывода чисел от 1 до 10.
// #include<iostream>
// using namespace std;
// int main(){
//     for(int i=1;i<11;i++){cout<<i<<endl;}
// }























